; AHK v2
; v 1.0.3
; RAlt + key
; - казахские буквы на буквенных клавишах
; - типографика и полезные символы на цифрах/знаках
; - Shift выбирает второй символ в паре

#Requires AutoHotkey v2.0

layout := Map(
    ; --- служебное / базовое
    "Space", [Chr(160), ""], ; неразрывный пробел

    ; --- клавиша ё / `~
    "vkC0", ["``", "~"],

    ; --- цифры
    "1", ["¹", "¡"],
    "2", ["²", "½"],
    "3", ["³", "⅓"],
    "4", ["$", "€"],
    "5", ["‰", ""],
    "6", ["ˆ", "↑"],
    "7", ["¿", ""],
    "8", ["∞", "≈"],
    "9", ["←", "〈"],
    "0", ["→", "〉"],

    ; --- знаки
    "vkBD", ["—", "–"], ; -
    "vkBB", ["≠", "±"], ; =

    ; --- казахские буквы
    "a", ["ә", "Ә"],
    "g", ["ғ", "Ғ"],
    "q", ["қ", "Қ"],
    "n", ["ң", "Ң"],
    "o", ["ө", "Ө"],
    "u", ["ұ", "Ұ"],
    "y", ["ү", "Ү"],
    "h", ["һ", "Һ"],
    "i", ["і", "І"],

    ; --- кириллические буквы
    "e", ["ў", "Ў"],
    "b", ["ї", "Ї"],
    "vkDE", ["є", "Є"], ; '

    ; --- символы и типографика
    "r", ["®", ""],
    "t", ["₸", "₽"],
    "p", ["′", "″"],

    "vkDB", ["[", "{"], ; [
    "vkDD", ["]", "}"], ; ]

    "d", ["°", "⌀"],
    "c", ["©", "™"],
    "j", ["„", ""],
    "k", ["“", "‘"],
    "l", ["”", "’"],

    "x", ["×", "·"],
    "m", ["−", "•"],

    "vkBC", ["«", "≤"], ; ,
    "vkBE", ["»", "≥"], ; .
    "vkBF", ["…", "́"]  ; /
)

for key, pair in layout {
    Hotkey("RAlt & " key, SendFromLayout.Bind(pair[1], pair[2]))
}

SendFromLayout(noShift, withShift, *) {
    ch := GetKeyState("Shift", "P") ? withShift : noShift
    if (ch = "")
        return
    SendText(ch)
}
