; AHK v2
; Типографская раскладка (RAlt + key); с учётом Shift

#Requires AutoHotkey v2.0

layout := Map(
    "vkC0", ["",   "̀"],

    "1",    ["¹",  "¡"],
    "2",    ["²",  "½"],
    "3",    ["³",  "⅓"],
    "4",    ["$",  "¼"],
    "5",    ["‰",  ""],
    "6",    ["↑",  "̂"],
    "7",    ["",   "¿"],
    "8",    ["∞",  ""],
    "9",    ["←",  "〈"],   ; вместо {ASC 9001}
    "0",    ["→",  "〉"],   ; вместо {ASC 9002}

    "vkBD", ["—",  "–"],   ; -
    "vkBB", ["≠",  "±"],   ; =
    "vkDC", ["",   ""],    ; \ (оба пусто)

    "q",    ["",   "̆"],
    "w",    ["",   ""],
    "e",    ["€",  ""],
    "r",    ["®",  "̊"],
    "t",    ["™",  ""],
    "y",    ["ѣ",  "Ѣ"],
    "u",    ["ѵ",  "Ѵ"],
    "i",    ["і",  "І"],
    "o",    ["ѳ",  "Ѳ"],
    "p",    ["′",  "″"],

    "vkDB", ["[",  "{"],   ; [
    "vkDD", ["]",  "}"],   ; ]

    "a",    ["≈",  "⌘"],
    "s",    ["§",  ""],
    "d",    ["°",  "⌀"],
    "f",    ["£",  ""],
    "g",    ["",   ""],
    "h",    ["₽",  ""],
    "j",    ["„",  ""],
    "k",    ["“",  "‘"],
    "l",    ["”",  "’"],

    "vkBA", ["‘",  "̈"],   ; ;
    "vkDE", ["’",  ""],    ; '

    "z",    ["",   "̉"],
    "x",    ["×",  "·"],
    "c",    ["©",  "¢"],
    "v",    ["↓",  "̌"],
    "b",    ["ß",  "ẞ"],
    "n",    ["₸",  "̃"],
    "m",    ["−",  "•"],

    "vkBC", ["«",  "„"],   ; ,
    "vkBE", ["»",  "“"],   ; .
    "vkBF", ["…",  "́"]    ; /
)

RAlt & Space:: SendText(Chr(160))

; --- Генерация хоткеев
for key, pair in layout {
    Hotkey("RAlt & " key, SendFromLayout.Bind(pair[1], pair[2]))
}

SendFromLayout(noShift, withShift, *) {
    ch := GetKeyState("Shift", "P") ? withShift : noShift
    if (ch = "")
        return
    SendText(ch)
}